Revit 2024 API
IFCExtrusionCalculatorOptions.ExtrusionAxes Property
 The extrusion axes to try when doing the calculation.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public IFCExtrusionAxes ExtrusionAxes { get; set; }
Visual Basic
Public Property ExtrusionAxes As IFCExtrusionAxes
	Get
	Set
Visual C++
public:
property IFCExtrusionAxes ExtrusionAxes {
	IFCExtrusionAxes get ();
	void set (IFCExtrusionAxes value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
IFCExtrusionCalculatorOptions Class
Autodesk.Revit.DB.IFC Namespace